--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY SAJJAD NOORI                   ▀▄ ▄▀ 
▀▄ ▄▀     BY SAJAD NOORI (@SAJJADNOORI)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY SAJJAD NOORI          ▀▄ ▄▀   
▀▄ ▄▀          help1  : مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'الاوامر' then
local S = [[
قبل لتشوف الاوامر تابع قناة البوت @iraqiiNTV ❤️💋

🔵#رفع اداري:يرفع ادمن للمجموعه
🔵#تنزيل ادري:يزل الادمن
✔️#رفع ادمن:علمود يضيف ادمن
🔘#تنزيل ادمن:حذف ادمن
🔵#الادمنيه:يشوفك ادمنيه المجموعه
🔵#يطلعلك الاداريين:اضهار اداريين المجموعه
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
✔️  قائمة الحضر والدفر اويلي هع
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
🔵#بلوك:يزحلك العضو
🔵#حظر:دفره بيه حض
🔵#لغاء الحظر:يشيل الحظر عن العضو
🔵#مغادره:ع مود تفلت
🔵#كتم : علمود اسوي عضو صامت ههع
🔵#الغاء الكم:يشيل الكتم عن العضو
🔵#منع كلمه: يحظر كلمة معينة
🔵#الغاء المنع: يفتح الحظر عن الكلمه
🔵#قائمه المنع: يطلع الكلمات المحظورة
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
✔️ حبي هاي اوامر الايدي والمعلومات
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
🔵#ايدي: يطلع ايدي هاي المجموعه
🔵#معلوماتي: يجيب الجنسيه كله ههه
🔵#معلومات المجموعه :يطلع معلومات المجموعه
🔵#الاعدادات: يطلع اعدادت المجموعه
🔵#اعدادات الوسائط ❣ يطلع اعدادات الوسائط
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
✔️  اوامر تخلي البوت يرتب المجموعه
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
🔵#القوانين:يطلع القوانين
🔵#ضع قوانين:يخلي قوانين
🔵#ضع وصف:يكتب وصف المجموعه
🔵#ضع صوره:يبدل صورة المجموعه
🔵#ضع اسم:يبدل اسم الكروب
🔵#ضع معرف:يحط معرف للكروب
🔵#تغير الرابط:لصنع الرابط او تغيرة
🔵#الرابط:يشوفك رابط المجموعه
🔵#الرابط خاص:يشمر الرابط بلخاص
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
✔️  آوامر القفل والفتح يعني محد يفلش هع
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
🔵#قفل الاضافه:محد يضيف اعضاء
🔵#قفل الاضافه:تفتح اضافة الاعضاء
🔵#قفل الدردشه:تقفل الدردشه
🔵#فتح الدردشه:تفتح الدردشه
🔵#قفل الصور:يمنعلك الصور
🔵#فتح الصور:يفتح منع الصور
🔵#قفل الصوت:محد يدز بصمه
🔵#فتح الصوت : يكدرون يدزون بصمات
🔵#قفل الفيديو:محد يدز فيديو
🔵#فتح الفيديو:يكدرون يدزون فيديو
🔵#قفل الروابط:محد يشمر رابط
🔵#فتح الروابط:يكدر يشمر رابط
🔵#قفل التكرار:محد يكرر
🔵#فتح التكرار:يكدرون يكررون
🔵#قفل الملصقات:يمنع الملصقات
🔵#فتح الملصقات:يفتح الملصقات
🔵#قفل الصور المتحركه:محد يدز صور متحرك
🔵#فتح الصور المتحركه:يفتح الصور المتحرك
🔵#قفل الفايلات:قفل ارسال الملفات
🔵#فتح الفايلات:فنح ارسال الملفات
🔵#قفل الكلايش:يمنع الكليشه
🔵#فتح الكلايش:محد يدز كليشه
🔵#قفل الاضافه الجماعيه:محد يضيف جوكه هع
🔵#فتح الاضافه الجماعيه:فتح اضافة الجوكه هع
🔵#قفل العربيه:محد يحجي عربي هع
🔵#فتح العربيه:الكل يحجي عربي هع
🔵#قفل اعاده توجيه:محد يسوي اعاده توجيه
🔵#فتح اعاده توجيه:فتح اعادة التوجيه
◼/زخرفة + سمك: لزخرفته
◼/اصنع مجموعة : لصنع مجموعة جديدة
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
تواصل مع المطور
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
👾#Dev : @z557z🔵
👾#Dev : @MT_1996
👾#Dev : @istar_IQ_BoT
👾#Dev : @IrAqIiNtV🔵
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
♨️ كروب الدعم: لاظهار رابط كروب الدعم 
♨️ @istar_iq_bot 
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-

]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_momod(msg) then
local S = " للبشرفين قفط انته شنو وتسوي هيج اصلن ما احترمك 😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"[#!/](الاوامر)$",
},
run = run 
}
end
