--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY SAJJAD NOORI                   ▀▄ ▄▀ 
▀▄ ▄▀     BY SAJAD NOORI (@SAJJADNOORI)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY SAJJAD NOORI          ▀▄ ▄▀   
▀▄ ▄▀       ⚪   help1  : مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "مساعدة" then
return [[ 👑🤖тιgσ_вσт🤖👑

🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
‌‌✅ Group Promote  commands
⚪#setadmin  : رفع اداري
⚪#demoteadmin : حذف اداري
⚪#promote :  رفع ادمن
⚪#demote   :ازالةادمن
⚪#modlist : لاظهار ادمنية المجموعة
⚪#admins : اضهار اداريين المجموعه
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡الطرد والحضر والكتم ❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#kick : طرد عبر يوزر او رد
⚪#ban : حضر عبر يوزر او رد
⚪#unban : فك حضر عبر يوزر او رد
⚪#kickme : للخروج من المجموعة
⚪#lock : للطرد والحظر معا 
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#muteuser:لتفعيل الصمت للعضو
⚪#unmute list: الغاء الصمت للعضو
⚪#block : لحضر الكلمة
⚪#unblock : لفتح حضر الكلمة
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡 الايدي والرابط والقوانين والوصف❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#rules لاضهار القوانين
⚪#setrules لاظافة القوانين
⚪about لاضهار الوصف
⚪#setabout لاظافة الوصف
⚪#id لاظهار الايدي
⚪#es @اضهار ايدي عبر :معرف 
⚪#id chat : لاضهار ايديات المجموعة
⚪#settings :اضهار ضبط المجموعه
⚪#link : لارسال رابط المجوعه  
⚪#newlink : لتغير رابط المجموعة  
⚪#etlink :لحفظ الرابط
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡 اوامر الكتم ومسح الوسائط  ❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#close chat:لقفل دردشة المجموعة
⚪#open chat:فتح الدردشه 

🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡كتم ومنع جميع الوسائط ❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#close:open:audio:البصمه 
⚪#close:open:gifs:الصور المتحركه
⚪#close:open :photo:الصور⚪
⚪#close:open:video:الفيديو
🔹🔹🔹🔹🔹🔹🔹🔹🔹✔اوامر جديد
⚪#res:معلومات عن المستخدم 
⚪/run : لعدم ايقاف البوت
⚪/redis : لتحديث السيرفر
⚪#help : اوامر خرافيه
⚪#me : معرفة موقعك
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹✔
⚪#close:open:links:لمنع الروابط
⚪#close:open:flood:لمنع التكرار
⚪#close:open:sticker:لمنع الملصقات
⚪#close:open:arabic:اللغه العربيه
⚪#close:open:member:اضافة الاعضاء 
⚪#close:open:spam:قفل السبام
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
#dEv-@z557z
#dEv-bot-@istar_iq_bot
#dEv-@@MT_1996
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
للإستفسار اكتب كلمة استفسار
لطلب إضافة البوت إلى مجموعتك اضغط كروب الدعم
اذ كنت محظور ولديك استفسار اكتب بوت تواصل
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
🔹ملاحظه لعرض الاوامر العربيه ارسل :#الاوامر
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
]]
end

if not is_momod(msg) then
return "ما اكدر اعذرنيي�🖕�"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(مساعدة)"
},
run = run 
}
end