do

local function run(msg, matches)
if is_momod(msg) and
if matches[1] == "help" then 
return [[
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
‌‌✅ Group Promote  commands
⚪#setadmin  : رفع اداري
⚪#demoteadmin : حذف اداري
⚪#promote :  رفع ادمن
⚪#demote   :ازالةادمن
⚪#modlist : لاظهار ادمنية المجموعة
⚪#admins : اضهار اداريين المجموعه
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡الطرد والحضر والكتم ❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#kick : طرد عبر يوزر او رد
⚪#ban : حضر عبر يوزر او رد
⚪#unban : فك حضر عبر يوزر او رد
⚪#kickme : للخروج من المجموعة
⚪#lock : للطرد والحظر معا 
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#muteuser:لتفعيل الصمت للعضو
⚪#unmute list: الغاء الصمت للعضو
⚪#block : لحضر الكلمة
⚪#unblock : لفتح حضر الكلمة
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡 الايدي والرابط والقوانين والوصف❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#rules لاضهار القوانين
⚪#setrules لاظافة القوانين
⚪about لاضهار الوصف
⚪#setabout لاظافة الوصف
⚪#id لاظهار الايدي
⚪#es @اضهار ايدي عبر :معرف 
⚪#id chat : لاضهار ايديات المجموعة
⚪#settings :اضهار ضبط المجموعه
⚪#link : لارسال رابط المجوعه  
⚪#newlink : لتغير رابط المجموعة  
⚪#etlink :لحفظ الرابط
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡 اوامر الكتم ومسح الوسائط  ❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#close chat:لقفل دردشة المجموعة
⚪#open chat:فتح الدردشه 
⚪#dele+العدد : لمسح الرسائل
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
💡كتم ومنع جميع الوسائط ❎
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
⚪#close:open:audio:البصمه 
⚪#close:open:gifs:الصور المتحركه
⚪#close:open :photo:الصور⚪
⚪#close:open:video:الفيديو
🔹🔹🔹🔹🔹🔹🔹🔹🔹✔اوامر جديد
⚪#sudo : يخص المطورين فقط
⚪/run : لعدم ايقاف البوت
⚪/redis : لتحديث السيرفر
⚪#help : اوامر خرافيه
⚪#me : معرفة موقعك
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹✔
⚪#close:open:links:لمنع الروابط
⚪#close:open:flood:لمنع التكرار
⚪#close:open:sticker:لمنع الملصقات
⚪#close:open:arabic:اللغه العربيه
⚪#close:open:member:اضافة الاعضاء 
⚪#close:open:spam:قفل السبام
🔹🔹🔹🔹🔹🔹🔹🔹🔹🔹
#dEv-@z557z
#dEv-bot-@istar_iq_bot
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
للإستفسار اكتب كلمة استفسار
لطلب إضافة البوت إلى مجموعتك اضغط كروب الدعم
اذ كنت محظور ولديك استفسار اكتب بوت تواصل
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
🔹ملاحظه لعرض الاوامر العربيه ارسل :#الاوامر
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
]]
end
if not is_momod(msg) then
return [[ 
 الاوامر المتاحه لك بللغه الانكليزيه
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
⚪#kickme : للخروج من المجموعة
⚪#rules لاضهار القوانين
⚪about لاضهار الوصف
⚪#id لاظهار الايدي
⚪#me : معرفة موقعك
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
 الاوامر المتاحه لك بللغه العربيه
🔹🔹🔹🔹🔹🔹🔹➖➖➖➖➖
🔵#ايدي: يطلع ايدي هاي المجموعه
🔵#معلوماتي: يجيب الجنسيه كله ههه
🔵#مغادره:ع مود تفلت
🔵#القوانين:يطلع القوانين
🔵#الرابط خاص:يشمر الرابط بلخاص
◼/اصنع مجموعة : لصنع مجموعة جديدة
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
تواصل مع المطور
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
👾#Dev : @z557z🔵
👾#Dev : @istar_IQ_BoT
👾#Dev : @IrAqIiNtV🔵
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
♨️ كروب الدعم: لاظهار رابط كروب الدعم 
♨️ @istar_iq_bot 
_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-
]] 
end
end

return {  
  patterns = {
       "^[!/](help)$",
  },
  run = run,
}

end
