-- made by { @Mouamle }
do
ws = {1} = "هلو"  -- msg
rs = {1} = "هلوات منور/ة"  -- reply

-- some examples of how to use this :3 
ws[3] = "انجب" -- msg
rs[3] = "يخي اتجاوزك بخلاقي😑" -- reply

ws[5] = "@z557z" -- msg 
rs[5] = "😒😒لك هذا مطوري شرايد تعال هنا @istar_iq_bot " -- reply

ws[6] = "استفسار" -- msg 
rs[6] = "للإستفسار يرجى التواصل مع مبرمج البوت @z557z" -- reply

ws[7] = "احبج" -- msg 
rs[7] = "يخي احترم شعوري😢" -- reply

ws[8] = "واكف" -- msg 
rs[8] = "يخي مابيه شي ليش تتفاول😢" -- reply

ws[9] = "المطور" -- msg 
rs[9] = "يخي نايم بعليك😂 من يجي اكله" -- reply

ws[10] = "البوت واكف" -- msg 
rs[10] = "هياتني 😐" -- reply 

ws[11] = "صدك" -- msg 
rs[11] = "متشاقي وياك كبل😕" -- reply

ws[12] = "اريد كروب" -- msg 
rs[12] = "☺تضيف 30 عضو بي" -- reply

ws[13] = "وين المطور" -- msg 
rs[13] = "مشغول تعال هنا @istar_iq_bot"  -- reply

ws[14] = "لك معليك اني و ضلعي" -- msg 
rs[14] = "😐اوك اثف"  -- reply

ws[15] = "😂" -- msg 
rs[15] = " •❤•فٌدِيـ❤ـِـْْت هلضحكه•❤•"

ws[17] = "كم بي" -- msg 
rs[17] = "😴لتتلزك" -- reply

ws[18] = "دي" -- msg 
rs[18] = "👺خليني حبك" -- reply

ws[19] = "انتيكو" -- msg 
rs[19] = "ا حبي تفضل محتاج مني شي تعال هنا @TiGo_BoT_iQ️" -- reply

ws[20] = "كروب الدعم" -- msg 
rs[20] = "👑معرف مجموعة دعم البوت 🤖 @TiGo_BoT_iQ" -- reply

ws[21] = "اي اضيف" -- msg 
rs[21] = "روحلهم خاص @Z_Z_5 ⚠ @Z557Z " -- reply

ws[22] = "انجب" -- msg 
rs[22] = "يخي اتجاوزك بخلاقي😑" -- reply

ws[23] = "كحاب" -- msg 
rs[23] = "امك وخواتك😈 لتجاوز تنطرد" -- reply

ws[24] = "افلش" -- msg 
rs[24] = "باند عام من 30 بوت😉" -- reply

ws[25] = "بدوري وين" -- msg 
rs[25] = "كلي هسه اجي 😕" -- reply

ws[26] = "ورده" -- msg 
rs[26] = "قندرتك فرده وفرده 😂" -- reply

ws[27] = "كروب الدعم" -- msg 
rs[27] = "⁉️    👑معرف مجموعة دعم البوت 🤖 :    @TiGo_BoT_iq 😷" -- reply

ws[28] = "صوف" -- msg 
rs[28] = "؏ـيــ❦ـونةة لصــوف 😻❤️" -- reply

ws[54] = "بوسني" -- msg
rs[54] =  "ٲٳٲمــﮨ﴿💋﴾ﮨﮨﮨﮨ﴿😚﴾ﮨــوٱآاﮨـٍٰح✵❤️ لحليكك/ج️"

ws[30] = "عبك" -- msg 
rs[30] = "اخرب عليك😍💋" -- reply

ws[31] = "تعال اتزوجك" -- msg 
rs[31] = "ايييي يله هاج معبس💍😍" -- reply

ws[32] = "حبيبي" -- msg 
rs[32] = "عيون حبيبي😍" -- reply

ws[33] = "بوت تواصل" -- msg 
rs[33] = "@istar_iq_bot 😍" -- reply

ws[34] = "يومه فدوه" -- msg 
rs[34] = "فدؤه الج حياتي 😍😙" -- reply

ws[35] = "شلونك بوت" -- msg 
rs[35] = " الحمد لله وانت😍😙" -- reply

ws[39] = "بدور" -- msg
rs[39] = "عيونه لبدور😍😙" -- 

ws[36] = "سكوتي" -- msg 
rs[36] = "ضاغط رسل"

ws[37] = "منو المطور"
rs[37] = "هذا @z557z"

ws[38] = "تخليني"
rs[38] = "انجب وكل خره ما مشاقيك"

ws[41] = "غبي"
rs[41] = "مو اغبه منك 😒"

ws[42] = "تف"
rs[42] = "عيب ابني تتفل اكبر شوية 🌚😂"

ws[43] = "امداج"
rs[43] = "امداج انتي😐"

ws[44] = "امداك"
rs[44] = " امداك انت 😒"

ws[45] = "شدسون"
rs[45] = "نطبخ😐"

ws[46] = "هع"
rs[46] = " هعهاعه التهعهع عظامك😂😂✋🏿"

ws[47] = "معليك"
rs[47] = " عليه ونص 😂"

ws[48] = "لتحجي"
rs[48] = " وانت شعليك حاجي من حلگگ😒"

ws[49] = "اكلك"
rs[49] = "كلي وما كول لاحد 😉"

ws[50] = "ضوجه"
rs[50] = "شسوي اركصلك ؟"

ws[51] = "احترم نفسك"
rs[51] = "احترمه انته بل بدايه 😶"

ws[52] = "تعالي خاص"
rs[52] = "ها شسون 😉"

ws[53] = "تعال خاص"
rs[53] = "ها شسون 😉"

ws[35] = "ها" -- msg
rs[35] = "هاي اچون چقله هاي🌚" -- rep

ws[28] = "انته وين" -- msg
rs[28] = "بالــبــ🏠ــيــت" -- rep

ws[29] = "وينك" -- msg
rs[29] = "بالــســ🚗ــيــارﮭﮧ" -- rep

ws[23] = "تمام" -- msg
rs[23] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣" -- rep

ws[33] = "😒" -- msg
rs[33] = "⌣ 😒شبيـــك /ج كـــالــب/ه 😡 خلقتـــك/ج ســـربـــوت/ه😒🌚 }⌣" -- rep

ws[37] = "تخليني"-- msg 
rs[37] = "تعالي ورة الكروب واخليك 😻🚶"--reply

ws[9] = "اتفل" -- msg 
rs[9] = "خخخخـ😩ـخخخ تفـ💦ـووووو💦💦" -- reply

ws[14] = "زاحف" -- msg 
rs[14] = "زاحف ع اختك مثلا🌚☝️🏽️" -- reply

ws[16] = "قناتي" -- msg 
rs[16] = " @iraqiiNTV" -- reply

ws[24] = "🌚" -- msg
rs[24] = "منور صخام الجدر😹☝" -- rep

ws[25] = "بوسه" -- msg
rs[25] = "امــہـ😘😚😘😚😘ــہــواااااح" -- rep

ws[26] = "شبيك" -- msg
rs[26] = "ديٌّــ﴿🌝🚬﴾ــًُي" -- rep

ws[2] = "بوت" -- msg
rs[2] = "مازا تريد منه🙄🍃" -- reply

ws[7] = "باي" -- msg 
rs[7] = " ﭘــًًٍٍّّّْــًٍٍُُّّّّْ✋ــٍٍُّّّاأٍٍّّأٍّﯾﮧٍّ🏃  " -- reply

ws[8] = "اكرهك" -- msg 
rs[8] = "عـلساس آٌنـّ'ℳέ'ـّي أحـبٍّـٍـٍـُـِՀօvεٍـٍـٍكـُّ💓 😝" -- reply

ws[4] = "ضوجة" -- msg 
rs[4] = "اي خرب وين نروح" -- reply

ws[5] = "اوف" -- msg 
rs[5] = "امشي خلي نروح للديسكو" -- reply

ws[6] = "يلة" -- msg 
rs[6] = "اصبر خل البس الحذاء هههه" -- reply

ws[7] = "معزوفة" -- msg 
rs[7] = "طم طم طح طح روح للكاع" -- reply

ws[17] = "بوس الاعضاء" -- msg 
rs[17] = "لا ونعال الحمزة استحي" -- reply

ws[21] = "شخبار صديقتك" -- msg 
rs[21] = "والله 🌚💔 تركتهة ️" -- reply

ws[22] = "ليش ولك تركتهة" -- msg 
rs[22] = "برب زنجرت 😂💔 رب ما بقة براسهة️" -- reply

ws[38] = "تسلم" -- msg 
rs[38] = "ادلل حبي 😘🌹" -- rep

ws[39] = "شكد" -- msg 
rs[39] = "اكثر مما تصور 🙊❤️" -- rep

ws[40] = "كلي حباب" -- msg 
rs[40] = "صفر 🙈 😂🚶🏿" -- rep

ws[41] = "الحمدلله" -- msg 
rs[41] = "دوم اخي الحبيب" -- rep

ws[45] = "الادمن" -- msg
rs[45] = "سيتواصل معكم الادمن قريبا" -- rep

ws[47] = "بوت" -- msg
rs[47] = "بوت tigo ارسل <<كروب الدعم>> لدخول مجموعة دعم بوتنا الافضل عربيا"

ws[48] = "هاي" -- msg
rs[48] = "هايات هلا منور/ة"

ws[51] = "هههه" -- msg
rs[51] = "دوم الضحكة"

ws[60] = "😳" -- msg
rs[60] =  "لَيِـــــــشُ مًـــــــصّـــــــ😁ـــــــدٍوٌوٌمً️"




-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		send_large_msg ( R , rs[i] );
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mouamle" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mouamle" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end